package Alishev;

/**
 * цикл for
 * условия ()
 * тело цикла в {}
 * условия на 3 блока 1- деклорация и инициализация переменной
 * 2- условие,до каких пор будет выполнтся
 * 3- какое действие будет выполнтся на каждом цикле
 */


public class alishev5for {
    public static void main(String[] args) {
        //переменная, затем условие, затем действие у нас переменная +
        //i++ = i+1
        for (int i = 0; i <= 10; i= i+5 ){
            System.out.println("Hello " + i);
        }
    }
}
